; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v2 ?v1)
             (pred_4 ?v12 ?v9)
             (pred_8 ?v2 ?v9)
             (pred_12 ?v5 ?v2 )
	     (pred_1 ?v2)
             (pred_2 ?v6)
             (pred_3 ?v12)
             (pred_9 ?v9)
             (pred_10 ?v2)
             (pred_6 ?v12)
             (pred_5 ?v2)
             (pred_7 ))



(:action op_1
:parameters (?v13 ?v7 ?v3 ?v10)
:precondition (and (pred_2 ?v13) (pred_2 ?v7) (pred_3 ?v3) (pred_9 ?v10)
          (pred_11 ?v13 ?v7) (pred_4 ?v3 ?v10)
                   (pred_8 ?v7 ?v10) (pred_1 ?v13) 
                   (pred_10 ?v7) (pred_6 ?v3))
:effect (and  (pred_5 ?v7) (not (pred_10 ?v7))))


(:action op_2
:parameters (?v13 ?v4)
:precondition (and (pred_2 ?v13) (pred_2 ?v4)
               (pred_1 ?v13) (pred_11 ?v13 ?v4) (pred_5 ?v4))
:effect (and (pred_1 ?v4) (not (pred_1 ?v13))))

(:action op_5
:parameters (?v13 ?v3)
:precondition (and (pred_2 ?v13) (pred_3 ?v3) 
                  (pred_1 ?v13) (pred_12 ?v3 ?v13) (pred_7 ))
:effect (and (pred_6 ?v3)
   (not (pred_12 ?v3 ?v13)) (not (pred_7 ))))


(:action op_4
:parameters (?v13 ?v8 ?v11)
:precondition (and (pred_2 ?v13) (pred_3 ?v8) (pred_3 ?v11)
                  (pred_1 ?v13) (pred_6 ?v11) (pred_12 ?v8 ?v13))
:effect (and (pred_6 ?v8) (pred_12 ?v11 ?v13)
        (not (pred_6 ?v11)) (not (pred_12 ?v8 ?v13))))

(:action op_3
:parameters (?v13 ?v3)
:precondition (and (pred_2 ?v13) (pred_3 ?v3) 
                  (pred_1 ?v13) (pred_6 ?v3))
:effect (and (pred_7 ) (pred_12 ?v3 ?v13) (not (pred_6 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_25 obj_04 obj_11 obj_26 obj_31 obj_28 obj_05 obj_30 obj_03 obj_29 obj_24 obj_02 obj_20 obj_15 obj_14 obj_17 obj_12 obj_22 obj_10 obj_08 obj_23 obj_18 obj_19 obj_09
    obj_13 obj_07 obj_01
    obj_16 obj_06 obj_27
    )

    (:init
       (pred_7)

       (pred_2 obj_21)
       (pred_2 obj_25)
       (pred_2 obj_04)
       (pred_2 obj_11)
       (pred_2 obj_26)
       (pred_2 obj_31)
       (pred_2 obj_28)
       (pred_2 obj_05)
       (pred_2 obj_30)
       (pred_2 obj_03)
       (pred_2 obj_29)
       (pred_2 obj_24)
       (pred_2 obj_02)
       (pred_2 obj_20)
       (pred_2 obj_15)
       (pred_2 obj_14)
       (pred_2 obj_17)
       (pred_2 obj_12)
       (pred_2 obj_22)
       (pred_2 obj_10)
       (pred_2 obj_08)
       (pred_2 obj_23)
       (pred_2 obj_18)
       (pred_2 obj_19)
       (pred_2 obj_09)
       (pred_9 obj_13)
       (pred_9 obj_07)
       (pred_9 obj_01)
       (pred_3 obj_16)
       (pred_3 obj_06)
       (pred_3 obj_27)

       (pred_11 obj_21 obj_31)
       (pred_11 obj_21 obj_25)
       (pred_11 obj_25 obj_28)
       (pred_11 obj_25 obj_04)
       (pred_11 obj_25 obj_21)
       (pred_11 obj_04 obj_05)
       (pred_11 obj_04 obj_11)
       (pred_11 obj_04 obj_25)
       (pred_11 obj_11 obj_30)
       (pred_11 obj_11 obj_26)
       (pred_11 obj_11 obj_04)
       (pred_11 obj_26 obj_03)
       (pred_11 obj_26 obj_11)
       (pred_11 obj_31 obj_29)
       (pred_11 obj_31 obj_28)
       (pred_11 obj_31 obj_21)
       (pred_11 obj_28 obj_24)
       (pred_11 obj_28 obj_05)
       (pred_11 obj_28 obj_25)
       (pred_11 obj_28 obj_31)
       (pred_11 obj_05 obj_02)
       (pred_11 obj_05 obj_30)
       (pred_11 obj_05 obj_04)
       (pred_11 obj_05 obj_28)
       (pred_11 obj_30 obj_20)
       (pred_11 obj_30 obj_03)
       (pred_11 obj_30 obj_11)
       (pred_11 obj_30 obj_05)
       (pred_11 obj_03 obj_15)
       (pred_11 obj_03 obj_26)
       (pred_11 obj_03 obj_30)
       (pred_11 obj_29 obj_14)
       (pred_11 obj_29 obj_24)
       (pred_11 obj_29 obj_31)
       (pred_11 obj_24 obj_17)
       (pred_11 obj_24 obj_02)
       (pred_11 obj_24 obj_28)
       (pred_11 obj_24 obj_29)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_02 obj_05)
       (pred_11 obj_02 obj_24)
       (pred_11 obj_20 obj_22)
       (pred_11 obj_20 obj_15)
       (pred_11 obj_20 obj_30)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_15 obj_10)
       (pred_11 obj_15 obj_03)
       (pred_11 obj_15 obj_20)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_14 obj_17)
       (pred_11 obj_14 obj_29)
       (pred_11 obj_17 obj_23)
       (pred_11 obj_17 obj_12)
       (pred_11 obj_17 obj_24)
       (pred_11 obj_17 obj_14)
       (pred_11 obj_12 obj_18)
       (pred_11 obj_12 obj_22)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_12 obj_17)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_22 obj_10)
       (pred_11 obj_22 obj_20)
       (pred_11 obj_22 obj_12)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_10 obj_15)
       (pred_11 obj_10 obj_22)
       (pred_11 obj_08 obj_23)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_23 obj_18)
       (pred_11 obj_23 obj_17)
       (pred_11 obj_23 obj_08)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_12)
       (pred_11 obj_18 obj_23)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_19)
       (pred_10 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_17)
       (pred_8  obj_03 obj_13)
       (pred_8  obj_10 obj_07)
       (pred_8  obj_17 obj_01)
       (pred_5 obj_21)
       (pred_5 obj_25)
       (pred_5 obj_04)
       (pred_5 obj_11)
       (pred_5 obj_26)
       (pred_5 obj_31)
       (pred_5 obj_28)
       (pred_5 obj_05)
       (pred_5 obj_30)
       (pred_5 obj_29)
       (pred_5 obj_24)
       (pred_5 obj_02)
       (pred_5 obj_20)
       (pred_5 obj_15)
       (pred_5 obj_14)
       (pred_5 obj_12)
       (pred_5 obj_22)
       (pred_5 obj_08)
       (pred_5 obj_23)
       (pred_5 obj_18)
       (pred_5 obj_19)
       (pred_5 obj_09)

       (pred_4  obj_16 obj_13)
       (pred_4  obj_06 obj_07)
       (pred_4  obj_27 obj_01)
       (pred_12 obj_16 obj_24)
       (pred_12 obj_06 obj_09)
       (pred_12 obj_27 obj_08)
       (pred_1 obj_09)
    )

    (:goal (and
       (pred_12 obj_27 obj_05)
    ))
(:constraints
  (always (not (pred_1 obj_28)))
)
)

; plan
1. (op_2 obj_09 obj_19)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_19)
   goals met: 0 of 1
2. (op_2 obj_19 obj_18)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_18)
   goals met: 0 of 1
3. (op_2 obj_18 obj_23)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_23)
   goals met: 0 of 1
4. (op_2 obj_23 obj_08)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_08)
   goals met: 0 of 1
5. (op_5 obj_08 obj_27)
   deleted: (pred_12 obj_27 obj_08) (pred_7)
   added: (pred_6 obj_27)
   goals met: 0 of 1
6. (op_2 obj_08 obj_14)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_14)
   goals met: 0 of 1
7. (op_2 obj_14 obj_29)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_29)
   goals met: 0 of 1
8. (op_2 obj_29 obj_24)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_24)
   goals met: 0 of 1
9. (op_2 obj_24 obj_02)
   deleted: (pred_1 obj_24)
   added: (pred_1 obj_02)
   goals met: 0 of 1
10. (op_2 obj_02 obj_05)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_05)
   goals met: 0 of 1
11. (op_3 obj_05 obj_27)
   deleted: (pred_6 obj_27)
   added: (pred_7) (pred_12 obj_27 obj_05)
   goals met: 1 of 1
